Merge pull request #3 from dngoins/dngoins/add-acd-hypothesis-readme
Dngoins/add acd hypothesis readme
